app/controllers/posts_controller.rb

  def home
    @home = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def index
    @posts = Post.where(user_id: current_user).order('created_at DESC')
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 2 ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)

    @post.user = current_user
    respond_to do |format|
      if @post.save
        format.html { redirect_to user_post_path(session[:user_id], Post.last), notice: 'Post was successfully created.' }
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "That's a Psot"], ["body", "Post it"], ["user_id", 1], ["created_at", 2016-06-27 08:09:23 UTC], ["updated_at", 2016-06-27 08:09:23 UTC]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def update
    if @post.user_id != session[:user_id]
      format.html { render "root", notice: "This post doesn't belong to you!" }
    end

    respond_to do |format|
      if @post.update(post_params)
        format.html { redirect_to user_post_path(session[:user_id], Post.last), notice: 'Post was successfully updated.' }
---
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Second Post"], ["body", "The Second Post"], ["updated_at", 2016-06-28 08:30:04 UTC], ["id", 10]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def destroy
    unless @post.user == current_user
      redirect_to home_path, notice: "This post doesn't belong to you!"
    else
      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]

  def like
    @user = current_user
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]