app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "geng@geng.com"], ["password_digest", "$2a$10$vSOvp9D4amPFfYJXpMDTnuxIwr34HzLGhQqnkscF4gdORvKcz26te"], ["created_at", 2016-06-27 04:22:58 UTC], ["updated_at", 2016-06-27 04:22:58 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save